{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "MY REMINDER – GPS Destination Reminder App (Multi-Screen Mobile UI)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement Home Screen with app logo, title, and navigation to Destination Input",
      "acceptanceCriteria": [
        "Home screen renders with a dark background and displays the app logo image",
        "Title 'MY REMINDER' is prominently displayed in bold golden/yellow typography",
        "A 'Set Destination' button is visible and navigates to the Destination Input screen on click",
        "Overall layout is clean, minimal, and uses rounded card styling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HomeScreen.tsx",
          "operation": "create",
          "description": "Create HomeScreen component displaying the generated app logo image (frontend/public/assets/generated/my-reminder-logo.dim_256x256.png), large bold title 'MY REMINDER' in golden yellow (#F5C518), a short tagline, and a prominent 'Set Destination' button with golden fill on dark background (#0A0A0A). The button triggers navigation to the Destination Input screen. Use rounded card layout and Material Design–inspired styling."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Set up multi-screen navigation state (or simple router) to manage transitions between Home, Destination Input, and Alert Settings screens. Wire HomeScreen as the default landing view and ensure 'Set Destination' button navigates to Destination Input screen."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Define global design system CSS custom properties for dark cinematic black background (#0A0A0A, #111111), golden yellow accent (#F5C518, #FFD700), rounded corner border-radius (16px), and modern sans-serif typography (Inter or system-ui). Ensure these variables are reusable across all screens."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement Destination Input Screen with search bar, map placeholder, and navigation to Alert Settings",
      "acceptanceCriteria": [
        "Destination Input screen is reachable from the Home screen's 'Set Destination' button",
        "A search bar with icon is displayed at the top of the screen",
        "A map preview card occupies the main content area with a visual placeholder showing a pin/marker",
        "A navigation button proceeds to the Alert Settings screen",
        "Styling follows dark cinematic black background with yellow/golden highlights"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DestinationInputScreen.tsx",
          "operation": "create",
          "description": "Create DestinationInputScreen component with: (1) a styled search bar featuring a location pin icon and placeholder text 'Search destination…', (2) a map preview card displaying the generated placeholder image (frontend/public/assets/generated/map-preview-placeholder.dim_390x260.png) showing a dark map tile with golden marker pin, and (3) a 'Next' or 'Set Alert' button at the bottom to navigate to Alert Settings screen. Include a top navigation bar with a back arrow icon (navigates to Home) and the screen title in golden text. Maintain dark background (#0A0A0A) and golden accent styling consistent with the design system."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire DestinationInputScreen into the navigation flow so it is reachable from HomeScreen's 'Set Destination' button and can navigate forward to AlertSettingsScreen."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement Alert Settings Screen with time options, sound toggle, and save functionality",
      "acceptanceCriteria": [
        "Alert Settings screen is reachable from the Destination Input screen",
        "Three time option chips (1 min, 2 min, 5 min) are displayed; only the selected one is highlighted in golden yellow",
        "A sound toggle switch is displayed with an on/off state and golden active styling",
        "A 'Save Reminder' button is present at the bottom of the screen",
        "Clicking 'Save Reminder' shows a confirmation toast/snackbar and returns the user to the Home screen",
        "Styling is consistent with the dark cinematic black + golden accent design system"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AlertSettingsScreen.tsx",
          "operation": "create",
          "description": "Create AlertSettingsScreen component with: (1) a section titled 'Remind Me Before Arrival' containing three selectable option chips/buttons ('1 min', '2 min', '5 min') where only one is active at a time and highlighted in golden yellow (#F5C518), (2) a sound toggle switch labeled 'Sound Alert' styled with golden active state, (3) a 'Save Reminder' primary CTA button at the bottom, and (4) a top navigation bar with back arrow icon (navigates to Destination Input) and screen title in golden text. Manage selected time option and sound toggle state locally in React state. On 'Save Reminder' click, show a confirmation toast/snackbar (using shadcn/ui toast or custom notification) and navigate back to HomeScreen."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire AlertSettingsScreen into the navigation flow so it is reachable from DestinationInputScreen and can navigate back to HomeScreen after saving reminder."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Implement multi-screen navigation system connecting Home, Destination Input, and Alert Settings",
      "acceptanceCriteria": [
        "Navigation flows correctly: Home → Destination Input → Alert Settings → Home",
        "Back navigation is available on Destination Input and Alert Settings screens",
        "Top bar displays screen title with golden styling on non-home screens"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Implement multi-screen navigation state management (using React state or a simple router pattern) to connect Home → Destination Input → Alert Settings → Home flow. Ensure back navigation works correctly on Destination Input and Alert Settings screens, returning to the previous screen in sequence."
        },
        {
          "path": "frontend/src/components/TopNavBar.tsx",
          "operation": "create",
          "description": "Create reusable TopNavBar component displaying a back arrow icon and the current screen title in golden text. This component is used on Destination Input and Alert Settings screens to provide consistent back navigation."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Apply consistent dark cinematic design system across all screens",
      "acceptanceCriteria": [
        "All screens use a near-black background (#0A0A0A–#111111 range)",
        "Golden/yellow (#F5C518 or similar) is used consistently for headings, active states, buttons, and accents",
        "All cards and containers have rounded corners (≥12px radius)",
        "Typography is clean, modern, and legible at mobile-equivalent viewport widths",
        "No blue or purple accent colors appear in the UI"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Expand global CSS to enforce the dark cinematic design system: background color #0A0A0A or #111111, primary accent golden yellow (#F5C518 or #FFD700), all interactive cards and containers use border-radius 16px, typography using modern sans-serif (Inter or system-ui) with varying weights, and minimal outline-style iconography. Ensure no blue or purple accent colors are used. Target young adult users with a professional and intuitive aesthetic inspired by Android Material Design 3."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind configuration to define custom color palette matching the design system: near-black background (#0A0A0A, #111111), golden yellow accent (#F5C518, #FFD700), and border-radius utilities (16px). Remove or override any default blue/purple theme colors."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Render app in a mobile-frame wrapper centered on desktop with subtle frame/shadow",
      "acceptanceCriteria": [
        "App content is constrained to a mobile-width container (~375–390px) centered on wider screens",
        "A visual frame or shadow around the mobile container is visible on desktop viewports",
        "No horizontal overflow or layout breaks occur at mobile widths"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the main app content in a mobile-frame container with max-width ~390px, centered horizontally on desktop viewports, with a subtle dark outer frame or shadow to reinforce the mobile app aesthetic. Ensure no horizontal overflow or layout breaks occur at mobile widths."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add CSS for mobile-frame wrapper styling: max-width constraint, centered alignment, subtle shadow/border, and responsive behavior to fill viewport on actual mobile devices."
        }
      ]
    }
  ]
}